# Terraform - genesis
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
src/shared/infrastructure/genesis relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/genesis/runs/run-TazzjMef593cvogk

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.tfe_organization.default: Refreshing...
module.common_resources_production.data.tfe_organization.default: Refreshing...
module.common_resources_staging.data.tfe_organization.default: Refreshing...
module.common_resources_staging.data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_production.data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
module.common_resources_staging.tfe_project.default: Refreshing state... [id=prj-WYDphEUPfyjfwZ3M]
module.common_resources_production.tfe_project.default: Refreshing state... [id=prj-7HpZhLrsCNdUP54U]
data.tfe_organization.default: Refresh complete after 0s [id=org-nicD2rVwVf6Q5UvH]
tfe_project.shared_project_name: Refreshing state... [id=prj-bxhnCxFSw61ryiJr]
module.common_resources_production.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-BTYMLSX6MqvFxYPV]
module.common_resources_production.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-pu8kE3JkhTS8xiAU]
module.common_resources_production.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-LwLZ2bMVF6AyzLj5]
module.common_resources_production.module.web.tfe_workspace.web: Refreshing state... [id=ws-DgHoZWyeKt6fT8c7]
module.common_resources_production.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-PLtb3bWsbz9fUYWD]
module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Refreshing state... [id=ws-hkjEetkHynFerkYa]
module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff: Refreshing state... [id=ws-bTNqDJe5AecKyCX1]
module.common_resources_production.module.gateway.tfe_workspace.gateway_api: Refreshing state... [id=ws-ceoFu7i1TpATdUhH]
module.common_resources_production.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-7WgsG2bsG1C7cbuo]
module.common_resources_production.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-A9dpLkyvMU11Yf4Y]
module.common_resources_production.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-qeJ2aLam1NMqPMvR]
tfe_workspace.shared: Refreshing state... [id=ws-WQewQdvqt1P2Kt5J]
module.common_resources_staging.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-DPHhSHfhg1CfCpFQ]
module.common_resources_staging.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-CChok3Bd7kLA5N63]
module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Refreshing state... [id=ws-N4oTEHdmzfxDBwNb]
module.common_resources_staging.module.gateway.tfe_workspace.gateway_api: Refreshing state... [id=ws-od1DszU9vtJbxWSL]
module.common_resources_staging.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-L26meBkVU1Q82uhL]
module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff: Refreshing state... [id=ws-ousLjjesVGGCpAaH]
module.common_resources_staging.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-vvMRMUJ3XRV9QYt1]
module.common_resources_staging.module.web.tfe_workspace.web: Refreshing state... [id=ws-BFNXrKkUMuRnQJGp]
module.common_resources_staging.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-jWPjsfzbyvy55RLx]
module.common_resources_staging.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-EHMQsmaNp4QaWSyW]
module.common_resources_staging.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-9KZcCGgjXNPXdCND]
module.common_resources_staging.module.web.tfe_workspace.web: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources_staging.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources_staging.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources_staging.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff: Drift detected (update)
module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Drift detected (update)
module.common_resources_production.module.web.tfe_workspace.web: Drift detected (update)
module.common_resources_production.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources_production.module.identity.tfe_workspace.identity: Drift detected (update)
module.common_resources_production.module.gateway.tfe_workspace.gateway_api: Drift detected (update)
module.common_resources_production.module.customer.tfe_workspace.customer: Drift detected (update)
module.common_resources_production.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common_resources_production.module.shared.tfe_workspace.shared: Drift detected (update)
module.common_resources_staging.module.gateway.tfe_workspace.gateway_api: Drift detected (update)
module.common_resources_staging.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common_resources_staging.module.identity.tfe_workspace.identity: Drift detected (update)
tfe_workspace.shared: Drift detected (update)
module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff: Drift detected (update)
module.common_resources_production.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common_resources_production.module.organization.tfe_workspace.organization: Drift detected (update)
module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff: Drift detected (update)
module.common_resources_staging.module.shared.tfe_workspace.shared: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # tfe_project.shared_project_name must be replaced
-/+ resource "tfe_project" "shared_project_name" {
      ~ id           = "prj-bxhnCxFSw61ryiJr" -> (known after apply)
        name         = "shared"
      ~ organization = "Connectilly" -> "connectilly" # forces replacement
    }

  # tfe_workspace.shared must be replaced
-/+ resource "tfe_workspace" "shared" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/shared" -> (known after apply)
      ~ id                            = "ws-WQewQdvqt1P2Kt5J" -> (known after apply)
        name                          = "shared"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-bxhnCxFSw61ryiJr" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.tfe_project.default must be replaced
-/+ resource "tfe_project" "default" {
      ~ id           = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
        name         = "production"
      ~ organization = "Connectilly" -> "connectilly" # forces replacement
    }

  # module.common_resources_staging.tfe_project.default must be replaced
-/+ resource "tfe_project" "default" {
      ~ id           = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
        name         = "staging"
      ~ organization = "Connectilly" -> "connectilly" # forces replacement
    }

  # module.common_resources_production.module.aws_oneoff.tfe_workspace.aws_oneoff must be replaced
-/+ resource "tfe_workspace" "aws_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_aws_oneoff" -> (known after apply)
      ~ id                            = "ws-bTNqDJe5AecKyCX1" -> (known after apply)
        name                          = "production_aws_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.customer.tfe_workspace.customer must be replaced
-/+ resource "tfe_workspace" "customer" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_customer" -> (known after apply)
      ~ id                            = "ws-A9dpLkyvMU11Yf4Y" -> (known after apply)
        name                          = "production_customer"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.customer.tfe_workspace.customer_api must be replaced
-/+ resource "tfe_workspace" "customer_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_customer_api" -> (known after apply)
      ~ id                            = "ws-7WgsG2bsG1C7cbuo" -> (known after apply)
        name                          = "production_customer_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 19 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.customer.tfe_workspace.customer_processor will be created
  + resource "tfe_workspace" "customer_processor" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production_customer_processor"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "customer",
          + "processor",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/customer-processor/infrastructure/workspaces/production"
    }

  # module.common_resources_production.module.gateway.tfe_workspace.gateway_api must be replaced
-/+ resource "tfe_workspace" "gateway_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_gateway_api" -> (known after apply)
      ~ id                            = "ws-ceoFu7i1TpATdUhH" -> (known after apply)
        name                          = "production_gateway_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 16 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.gcp_oneoff.tfe_workspace.gcp_oneoff must be replaced
-/+ resource "tfe_workspace" "gcp_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_gcp_oneoff" -> (known after apply)
      ~ id                            = "ws-hkjEetkHynFerkYa" -> (known after apply)
        name                          = "production_gcp_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.identity.tfe_workspace.identity must be replaced
-/+ resource "tfe_workspace" "identity" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_identity" -> (known after apply)
      ~ id                            = "ws-qeJ2aLam1NMqPMvR" -> (known after apply)
        name                          = "production_identity"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.identity.tfe_workspace.identity_api must be replaced
-/+ resource "tfe_workspace" "identity_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_identity_api" -> (known after apply)
      ~ id                            = "ws-BTYMLSX6MqvFxYPV" -> (known after apply)
        name                          = "production_identity_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 19 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.organization.tfe_workspace.organization must be replaced
-/+ resource "tfe_workspace" "organization" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_organization" -> (known after apply)
      ~ id                            = "ws-PLtb3bWsbz9fUYWD" -> (known after apply)
        name                          = "production_organization"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.organization.tfe_workspace.organization_api must be replaced
-/+ resource "tfe_workspace" "organization_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_organization_api" -> (known after apply)
      ~ id                            = "ws-pu8kE3JkhTS8xiAU" -> (known after apply)
        name                          = "production_organization_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 19 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.shared.tfe_workspace.shared must be replaced
-/+ resource "tfe_workspace" "shared" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_shared" -> (known after apply)
      ~ id                            = "ws-LwLZ2bMVF6AyzLj5" -> (known after apply)
        name                          = "production_shared"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 12 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_production.module.web.tfe_workspace.web must be replaced
-/+ resource "tfe_workspace" "web" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/production_web" -> (known after apply)
      ~ id                            = "ws-DgHoZWyeKt6fT8c7" -> (known after apply)
        name                          = "production_web"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-7HpZhLrsCNdUP54U" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 11 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.aws_oneoff.tfe_workspace.aws_oneoff must be replaced
-/+ resource "tfe_workspace" "aws_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_aws_oneoff" -> (known after apply)
      ~ id                            = "ws-ousLjjesVGGCpAaH" -> (known after apply)
        name                          = "staging_aws_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.customer.tfe_workspace.customer must be replaced
-/+ resource "tfe_workspace" "customer" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_customer" -> (known after apply)
      ~ id                            = "ws-EHMQsmaNp4QaWSyW" -> (known after apply)
        name                          = "staging_customer"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.customer.tfe_workspace.customer_api must be replaced
-/+ resource "tfe_workspace" "customer_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_customer_api" -> (known after apply)
      ~ id                            = "ws-L26meBkVU1Q82uhL" -> (known after apply)
        name                          = "staging_customer_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 19 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.customer.tfe_workspace.customer_processor will be created
  + resource "tfe_workspace" "customer_processor" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging_customer_processor"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "customer",
          + "processor",
          + "staging",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/customer-processor/infrastructure/workspaces/staging"
    }

  # module.common_resources_staging.module.gateway.tfe_workspace.gateway_api must be replaced
-/+ resource "tfe_workspace" "gateway_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_gateway_api" -> (known after apply)
      ~ id                            = "ws-od1DszU9vtJbxWSL" -> (known after apply)
        name                          = "staging_gateway_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 16 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.gcp_oneoff.tfe_workspace.gcp_oneoff must be replaced
-/+ resource "tfe_workspace" "gcp_oneoff" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_gcp_oneoff" -> (known after apply)
      ~ id                            = "ws-N4oTEHdmzfxDBwNb" -> (known after apply)
        name                          = "staging_gcp_oneoff"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 0 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.identity.tfe_workspace.identity must be replaced
-/+ resource "tfe_workspace" "identity" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_identity" -> (known after apply)
      ~ id                            = "ws-CChok3Bd7kLA5N63" -> (known after apply)
        name                          = "staging_identity"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.identity.tfe_workspace.identity_api must be replaced
-/+ resource "tfe_workspace" "identity_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_identity_api" -> (known after apply)
      ~ id                            = "ws-vvMRMUJ3XRV9QYt1" -> (known after apply)
        name                          = "staging_identity_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 19 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.organization.tfe_workspace.organization must be replaced
-/+ resource "tfe_workspace" "organization" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_organization" -> (known after apply)
      ~ id                            = "ws-jWPjsfzbyvy55RLx" -> (known after apply)
        name                          = "staging_organization"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 8 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.organization.tfe_workspace.organization_api must be replaced
-/+ resource "tfe_workspace" "organization_api" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_organization_api" -> (known after apply)
      ~ id                            = "ws-9KZcCGgjXNPXdCND" -> (known after apply)
        name                          = "staging_organization_api"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 19 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.shared.tfe_workspace.shared must be replaced
-/+ resource "tfe_workspace" "shared" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_shared" -> (known after apply)
      ~ id                            = "ws-DPHhSHfhg1CfCpFQ" -> (known after apply)
        name                          = "staging_shared"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 12 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.common_resources_staging.module.web.tfe_workspace.web must be replaced
-/+ resource "tfe_workspace" "web" {
      - assessments_enabled           = false -> null
      ~ global_remote_state           = false -> (known after apply)
      ~ html_url                      = "https://app.terraform.io/app/Connectilly/workspaces/staging_web" -> (known after apply)
      ~ id                            = "ws-BFNXrKkUMuRnQJGp" -> (known after apply)
        name                          = "staging_web"
      ~ operations                    = false -> (known after apply)
      ~ organization                  = "Connectilly" -> "connectilly" # forces replacement
      ~ project_id                    = "prj-WYDphEUPfyjfwZ3M" -> (known after apply)
      ~ remote_state_consumer_ids     = [] -> (known after apply)
      ~ resource_count                = 11 -> (known after apply)
      ~ terraform_version             = "1.4.6" -> (known after apply)
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
        # (10 unchanged attributes hidden)
    }

Plan: 28 to add, 0 to change, 26 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*